bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
/* 
 * Copyright(C) 2013 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-usb_fs_dev.c
 * @brief STM32F USB Full Speed Device Driver
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifdef CONFIG_H
#include "config.h"
#endif

#include <sys/stm32f.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <arch/cortex-m3.h>
#include <sys/delay.h>
#include <sys/usb-dev.h>
#include <sys/param.h>

#include <sys/dcclog.h>
#include <vt100.h>

#ifndef STM32_ENABLE_USB_FS
#define STM32_ENABLE_USB_FS 1
#endif 

#ifndef STM32_USB_FS_SUSPEND
#define STM32_USB_FS_SUSPEND     0
#endif

#ifndef STM32_USB_FS_EP_MAX 
#define STM32_USB_FS_EP_MAX      8
#endif

#ifndef STM32_USB_FS_IRQ_ENABLE
#define STM32_USB_FS_IRQ_ENABLE  0
#endif

#ifndef STM32_USB_FS_IO_INIT
#define STM32_USB_FS_IO_INIT     0
#endif

#ifndef STM32_USB_FS_VBUS_ENABLE
#define STM32_USB_FS_VBUS_ENABLE 0
#endif

#ifndef ENABLE_PEDANTIC_CHECK
#define ENABLE_PEDANTIC_CHECK 0
#endif

#if defined(STM32F_USB) && (STM32_ENABLE_USB_FS)

#ifndef ENABLE_IRQ_MASK
#define ENABLE_IRQ_MASK 0
#endif

#ifndef ENABLE_DBLBUF_DEBUG
#define ENABLE_DBLBUF_DEBUG 0
#endif

#ifndef DOUBLE_BUFFER_ENABLE
#define DOUBLE_BUFFER_ENABLE 1
#endif

/* Endpoint state */
enum ep_state {
	EP_DISABLED,
	EP_IDLE,
	EP_STALLED,
	EP_SETUP,
	EP_IN_DATA,
	EP_IN_DATA_LAST,
	EP_WAIT_STATUS_IN,
	EP_WAIT_STATUS_OUT,
	EP_OUT_DATA,
	EP_OUT_DATA_LAST
};

/* Endpoint control */
struct stm32f_usb_ep {
	volatile uint8_t state; /* Current EP state */
	uint8_t addr;
	uint16_t mxpktsz; /* Maximum packet size for this EP */
	union {
		struct {
			volatile uint16_t xfr_rem; /* Bytes pendig in the transfer buffer */
			uint16_t xfr_buf_len; /* Length of the transfer buffer */
			uint8_t * xfr_buf; /* Transfer buffer pointer */
			uint8_t * volatile xfr_ptr; /* Pointer to the next transfer */
		};
		struct {
			volatile uint16_t rx_len;
			volatile uint16_t rx_pos;
			volatile uint32_t rx_dat;
			struct stm32f_usb_rx_pktbuf * rx_pktbuf;
		};
	};

	/* Endpoint callback */
	union {
		usb_class_on_ep_ev_t on_ev;
		usb_class_on_ep_in_t on_in;
		usb_class_on_ep_out_t on_out;
		usb_class_on_ep_setup_t on_setup;
	};
};

/* FIXME: find another way of initializing the packet buffer addresses */
#define PKTBUF_BUF_BASE (8 * 8)

/* USB Driver */
struct stm32f_usb_drv {
	struct stm32f_usb_ep ep[STM32_USB_FS_EP_MAX];
	usb_class_t * cl;
	const struct usb_class_events * ev;
	struct usb_request req;
#if (ENABLE_DBLBUF_DEBUG)
	uint32_t pkt_recv;
	uint32_t pkt_read;
#endif
	uint16_t pktbuf_addr;
};


/* -------------------------------------------------------------------------
 * End point packet buffer helpers
 * ------------------------------------------------------------------------- */

#if defined(STM32L4X)

static uint16_t * __rx_pktbuf_ptr(struct stm32f_usb_rx_pktbuf * p) {
	return (uint16_t *)STM32F_USB_PKTBUF_ADDR + (p->addr / 2);
}

static void __copy_from_pktbuf(void * ptr,
							   struct stm32f_usb_rx_pktbuf * rx, 
							   unsigned int cnt)
{
	uint8_t * dst = (uint8_t *)ptr;
	uint16_t * src;
	uint32_t data;
	unsigned int i;

	/* copy data from source buffer */
	src = (uint16_t *)STM32F_USB_PKTBUF_ADDR + (rx->addr / 2);
	for (i = 0; i < (cnt + 1) / 2; i++) {
		data = *src++;
		*dst++ = data;
		*dst++ = data >> 8;
	}
}

static void __copy_to_pktbuf(struct stm32f_usb_tx_pktbuf * tx,
							 uint8_t * src, unsigned int len)
{
	uint16_t * dst;
	unsigned int i;

	/* copy data to destination buffer */
	dst = (uint16_t *)STM32F_USB_PKTBUF_ADDR + (tx->addr / 2);
	for (i = 0; i < ((len + 1) / 2); i++) {
		*dst++ = src[0] | (src[1] << 8);
		src += 2;
	}

	tx->count = len;
}

#else

static uint32_t * __rx_pktbuf_ptr(struct stm32f_usb_rx_pktbuf * p) {
	return (uint32_t *)STM32F_USB_PKTBUF_ADDR + (p->addr / 2);
}

static void __copy_from_pktbuf(void * ptr,
							   struct stm32f_usb_rx_pktbuf * rx, 
							   unsigned int cnt)
{
	uint8_t * dst = (uint8_t *)ptr;
	uint32_t * src;
	uint32_t data;
	unsigned int i;

	/* copy data from source buffer */
	src = (uint32_t *)STM32F_USB_PKTBUF_ADDR + (rx->addr / 2);
	for (i = 0; i < (cnt + 1) / 2; i++) {
		data = *src++;
		*dst++ = data;
		*dst++ = data >> 8;
	}
}

static void __copy_to_pktbuf(struct stm32f_usb_tx_pktbuf * tx,
							 uint8_t * src, int len)
{
	uint32_t * dst;
	int i;

	/* copy data to destination buffer */
	dst = (uint32_t *)STM32F_USB_PKTBUF_ADDR + (tx->addr / 2);
	for (i = 0; i < ((len + 1) / 2); i++) {
		*dst++ = src[0] | (src[1] << 8);
		src += 2;
	}

	tx->count = len;
}

#endif


/* -------------------------------------------------------------------------
 * End point low level operations
 * ------------------------------------------------------------------------- */

static void __ep_stall(struct stm32f_usb * usb, int ep_id, 
					   struct stm32f_usb_ep * ep)
{
	__set_ep_txstat(usb, ep_id, USB_TX_STALL);
	__set_ep_rxstat(usb, ep_id, USB_RX_STALL);

	DCC_LOG1(LOG_INFO, "ep_id=%d [STALLED]", ep_id);
	ep->state = EP_STALLED;
}

static int __ep_pkt_send(struct stm32f_usb * usb, int ep_id,
						 struct stm32f_usb_ep * ep, 
						 struct stm32f_usb_tx_pktbuf * tx_pktbuf)
{
	int len;

	len = MIN(ep->xfr_rem, ep->mxpktsz);

	__copy_to_pktbuf(tx_pktbuf, ep->xfr_ptr, len);
	ep->xfr_ptr += len;
	ep->xfr_rem -= len;

	if ((ep->xfr_rem == 0) && (len != ep->mxpktsz)) {
		/* if we put all data into the TX packet buffer but the data
		 * didn't fill the whole packet, this is the last packet,
		 * otherwise we need to send a ZLP to finish the transaction */
		DCC_LOG2(LOG_INFO, VT_PSH VT_FGR  "[%d] len=%d [EP_IN_DATA_LAST]"
				 VT_POP, ep_id, len);
		ep->state = EP_IN_DATA_LAST;
	} else {
		DCC_LOG2(LOG_INFO, VT_PSH VT_FGR VT_DIM "[%d] len=%d [EP_IN_DATA]"
				 VT_POP, ep_id, len);
		ep->state = EP_IN_DATA;
	}

	return len;
}

static void __ep_zlp_send(struct stm32f_usb * usb, int ep_id)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;

	pktbuf[ep_id].tx.count = 0;
	__set_ep_txstat(usb, ep_id, USB_TX_VALID);
}

/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */

#if (STM32_USB_FS_SUSPEND) 
static void stm32f_usb_dev_suspend(struct stm32f_usb_drv * drv)
{
	struct stm32f_usb * usb = STM32F_USB;

	/* A brief description of a typical suspend procedure is provided 
	   below, focused on the USB-related aspects of the application 
	   software routine responding to the SUSP notification of the 
	   USB peripheral:
	   1. Set the FSUSP bit in the USB_CNTR register to 1. 
	   This action activates the suspend mode within the USB peripheral. 
	   As soon as the suspend mode is activated, the check on SOF 
	   reception is disabled to avoid any further SUSP interrupts being 
	   issued while the USB is suspended.
	   2. Remove or reduce any static power consumption in blocks 
	   different from the USB peripheral.
	   3. Set LP_MODE bit in USB_CNTR register to 1 to remove static power 
	   consumption in the analog USB transceivers but keeping them able to 
	   detect resume activity.
	   4. Optionally turn off external oscillator and device PLL to stop 
	   any activity inside the device. */

	usb->cntr |= USB_FSUSP;
	/* Enable Reset and Wakeup interrupts */
	usb->cntr = USB_WKUPM | USB_RESETM;
	drv->ev->on_suspend(drv->cl);
	/* Low power mode */
	usb->cntr |= USB_LP_MODE;
	DCC_LOG(LOG_INFO, "suspended.");
}

