bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
static void stm32f_usb_dev_wakeup(struct stm32f_usb_drv * drv)
{
	struct stm32f_usb * usb = STM32F_USB;
	uint32_t fnr = usb->fnr;

	if (((fnr & (USB_RXDP | USB_RXDM)) == 0) || 
		((fnr & (USB_RXDP | USB_RXDM)) == USB_RXDM)) {
	
		/* Clear FSUSP flag */
		usb->cntr = USB_WKUPM | USB_RESETM;

		DCC_LOG(LOG_INFO, "wakeup.");

		drv->ev->on_wakeup(drv->cl);
	}
}
#endif


static void stm32f_usb_dev_reset(struct stm32f_usb_drv * drv)
{
	struct stm32f_usb * usb = STM32F_USB;
	uint32_t cntr;

	DCC_LOG(LOG_INFO, "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");

	/* set the btable address */
	usb->btable = 0x000;

	drv->ev->on_reset(drv->cl);

	/* Enable the device and set the address to 0 */
	usb->daddr = USB_EF + 0;

	/* Enable Correct transfer interrupts */
	cntr = usb->cntr;
#if (STM32_USB_FS_SUSPEND) 
	cntr |= USB_CTRM | USB_SUSPM;
#else
	cntr |= USB_CTRM;
#endif
#if DEBUG
	cntr |= USB_ERRM;
//	cntr |= USB_SOFM;
#endif
	/* Write back */
	usb->cntr = cntr;

	DCC_LOG1(LOG_TRACE, "CNTR=0x%04x", usb->cntr );

#if (ENABLE_DBLBUF_DEBUG)
	drv->pkt_read = 0;
	drv->pkt_recv = 0;
#endif
}

/* ------------------------------------------------------------------------- */


/* start sending */
int stm32f_usb_ep_pkt_xmit(struct stm32f_usb_drv * drv, int ep_id,
						   void * buf, unsigned int len)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	struct stm32f_usb_ep * ep = &drv->ep[ep_id];
	struct stm32f_usb_tx_pktbuf * tx_pktbuf;
	struct stm32f_usb * usb = STM32F_USB;
#if (ENABLE_IRQ_MASK)
	uint32_t pri;
#endif
	uint32_t epr;

	if (len == 0) {
		DCC_LOG1(LOG_WARNING, VT_PSH VT_FGR VT_REV 
				 "[%d] len=0!!!" VT_POP, 
				 ep_id);
		return 0;
	}

	ep = &drv->ep[ep_id];

#if (ENABLE_IRQ_MASK)
	pri = cm3_primask_get();
	cm3_primask_set(1);
#endif
	if (ep->state != EP_IDLE) {
		DCC_LOG2(LOG_MSG, VT_PSH VT_FGR VT_REV 
				 "[%d] len=%d invalid endpoint state!" VT_POP,
				 ep_id, len);
		len = 0;
	} else {
		ep->xfr_ptr = buf;
		ep->xfr_rem = len;
		epr = usb->epr[ep_id];
		if (epr & USB_EP_DBL_BUF) {
#if (ENABLE_DBLBUF_DEBUG)
			DCC_LOG4(LOG_MSG, VT_PSH VT_FGR 
					 "[%d] len=%d TX DblBuf DTOG=%d SW_BUF=%d " 
					 VT_POP, ep_id, len,
					 (epr & USB_DTOG_TX) ? 1: 0,
					 (epr & USB_SWBUF_TX) ? 1: 0);
#endif
			/* select the descriptor according to the data toggle bit */
			tx_pktbuf = &pktbuf[ep_id].dbtx[(epr & USB_SWBUF_TX) ? 1: 0];
			len = __ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
			ep->xfr_rem = 0;
			__toggle_ep_flag(usb, ep_id, USB_SWBUF_TX);
		} else {
			DCC_LOG2(LOG_MSG, VT_PSH VT_FGR " len=%d [%d] single" 
					 VT_POP, ep_id, len);
			tx_pktbuf = &pktbuf[ep_id].tx;
			len = __ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
			ep->xfr_rem = 0;
			__set_ep_txstat(usb, ep_id, USB_TX_VALID);
		}
	}

#if (ENABLE_IRQ_MASK)
	cm3_primask_set(pri);
#endif

	return len;
}

#define USB_SWBUF_RX_BIT 6
#define USB_DTOG_RX_BIT 14

int stm32f_usb_dev_ep_pkt_recv(struct stm32f_usb_drv * drv, int ep_id,
							   void * buf, unsigned int len)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	struct stm32f_usb * usb = STM32F_USB;
	struct stm32f_usb_ep * ep;
#if (ENABLE_IRQ_MASK)
	uint32_t pri;
#endif
	uint32_t epr;
	unsigned int rem;
	int pos;

	ep = &drv->ep[ep_id];
	(void)ep;

#if (ENABLE_IRQ_MASK)
	pri = cm3_primask_get();
	cm3_primask_set(1);
#endif
	pos = ep->rx_pos;
	rem = ep->rx_len - pos;

	if ((len = MIN(rem, len)) > 0) {
		DCC_LOG2(LOG_MSG, VT_PSH VT_FBL VT_BRI
				 "[%d] len=%d" 
				 VT_POP, ep_id, len); 

		struct stm32f_usb_rx_pktbuf * rx_pktbuf;
#if defined(STM32L4X)
		uint16_t * src;
#else
		uint32_t * src;
#endif
		uint8_t * dst;
		uint32_t data;
		unsigned int cnt;
		unsigned int i;
		unsigned int n;

		rx_pktbuf = ep->rx_pktbuf; 
		/* FIXME: is EP still enabled */
		src = __rx_pktbuf_ptr(rx_pktbuf) + (pos / 2);
		dst = (uint8_t *)buf;
		cnt = 0;

		if (pos & 0x01) {
			data = *src++;
			data = ep->rx_dat;
			*dst++ = data >> 8;
			cnt++;
		}

		n = (len - cnt) / 2;
		for (i = 0; i < n; i++) {
			data = *src++;
			*dst++ = data;
			*dst++ = data >> 8;
		}

		cnt += 2 * n;

		if (cnt < len) {
			data = *src;
			*dst = data;
			ep->rx_dat = data;
			cnt++;
		}

		ep->rx_pos = pos + len;


//		if (((ep->rx_len + 1) & ~0x1) == ((ep->rx_pos + 1) & ~0x1)) {
//
		if (rem == len) {
			epr = usb->epr[ep_id];
			if (epr & USB_EP_DBL_BUF) {
				rx_pktbuf->count = 0;
				/* release the buffer to the USB controller */
				/* Toggle SWBUF_RX flag */
				usb->epr[ep_id] = (epr & USB_EPREG_MASK) | USB_SWBUF_RX;

				epr = usb->epr[ep_id];
				/* select the descriptor according to the data toggle bit */
				rx_pktbuf = &pktbuf[ep_id].dbrx[(epr >> USB_SWBUF_RX_BIT) & 1];
				n = rx_pktbuf->count;

				if ((epr & USB_STAT_RX_MSK) == USB_RX_VALID) {
					if (((epr >> USB_DTOG_RX_BIT) ^
						 (epr >> USB_SWBUF_RX_BIT)) & 1) {
						DCC_LOG4(LOG_MSG, VT_PSH VT_FBL VT_BRI VT_UND
								 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
								 VT_POP, ep_id, 
								 (epr & USB_DTOG_RX) ? 1 : 0, 
								 (epr & USB_SWBUF_RX) ? 1 : 0, n); 
						ep->rx_pktbuf = rx_pktbuf;
						ep->rx_len = n;
						ep->rx_pos = 0;
					} else {
						DCC_LOG4(LOG_MSG, VT_PSH VT_FBL
								 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
								 VT_POP, ep_id, 
								 (epr & USB_DTOG_RX) ? 1 : 0, 
								 (epr & USB_SWBUF_RX) ? 1 : 0, n); 
					}
				} else {
					DCC_LOG4(LOG_INFO, VT_PSH VT_FRD
							 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
							 VT_POP, ep_id, 
							 (epr & USB_DTOG_RX) ? 1 : 0, 
							 (epr & USB_SWBUF_RX) ? 1 : 0, len); 
				}

			} else {

				rx_pktbuf->count = 0;
				/* free the out(rx) packet buffer */
				usb->epr[ep_id] = (epr | USB_RX_VALID) & USB_EPREG_MASK;
			}
		}
	} else {
		DCC_LOG1(LOG_MSG, VT_PSH VT_FBL VT_BRI
				 "[%d] empty!" VT_POP, ep_id); 
	}

#if (ENABLE_IRQ_MASK)
	cm3_primask_set(pri);
#endif

	return len;
}


int stm32f_usb_dev_ep_ctl(struct stm32f_usb_drv * drv, 
						  int ep_id, unsigned int opt)
{
	struct stm32f_usb_ep * ep = &drv->ep[ep_id];
	struct stm32f_usb * usb = STM32F_USB;

