bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
	DCC_LOG2(LOG_MSG, "ep=%d opt=%d", ep_id, opt);

#if DEBUG
	if ((unsigned int)ep_id >= STM32_USB_FS_EP_MAX) {
		DCC_LOG(LOG_WARNING, "invalid EP");
		return -1;
	}
#endif

	switch (opt) {
	case USB_EP_RECV_OK:
		break;

	case USB_EP_NAK_CLR:
		__set_ep_txstat(usb, ep_id, USB_TX_VALID);
		break;

	case USB_EP_NAK_SET:
		__set_ep_txstat(usb, ep_id, USB_TX_NAK);
		break;

	case USB_EP_ZLP_SEND:
		__ep_zlp_send(usb, ep_id);
		break;

	case USB_EP_STALL_SET:
		__ep_stall(usb, ep_id, ep);
		break;

	case USB_EP_STALL_CLR:
		/* TODO: implement stall clear ... */
		break;
#if 0
	case USB_EP_IN_REQ:
		/* COMM API: Unmask SOF interrupts */
		DCC_LOG(LOG_WARNING, "EP IN REQ");
		usb->cntr |= USB_SOFM;
		break;
#endif
	case USB_EP_DISABLE:
		ep->state = EP_DISABLED;
		__set_ep_txstat(usb, ep_id, USB_TX_DISABLED);
		__set_ep_rxstat(usb, ep_id, USB_RX_DISABLED);
		__clr_ep_flag(usb, ep_id, USB_CTR_RX | USB_CTR_TX);
		__set_ep_addr(usb, ep_id, 0);
		break;
	}

	return 0;
}

int stm32f_usb_dev_ep_init(struct stm32f_usb_drv * drv, 
						   const usb_dev_ep_info_t * info,
						   void * xfr_buf, int buf_len)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	struct stm32f_usb * usb = STM32F_USB;
	struct stm32f_usb_ep * ep;
	unsigned int sz;
	int mxpktsz = info->mxpktsz;
	int ep_id;

	if ((ep_id = info->addr & 0x7f) > 7) {
		DCC_LOG1(LOG_WARNING, "addr(%d) > 7", ep_id);
		return -1;
	}

	ep = &drv->ep[ep_id];
	ep->mxpktsz = mxpktsz;
	ep->state = EP_IDLE;
	ep->on_ev = info->on_ev;

	ep->xfr_buf = (uint8_t *)xfr_buf;
	ep->xfr_buf_len = buf_len;

	DCC_LOG3(LOG_INFO, "ep_id=%d addr=%d mxpktsz=%d",
			 ep_id, info->addr & 0x7f, mxpktsz);

	/* clear the correct transfer bits */
	__clr_ep_flag(usb, ep_id, USB_CTR_RX | USB_CTR_TX);

	if (ep_id == 0) {
		__set_ep_type(usb, 0, USB_EP_CONTROL);
		__set_ep_txstat(usb, 0, USB_TX_NAK);

		/* reset packet buffer address pointer */
		drv->pktbuf_addr = PKTBUF_BUF_BASE;

		/* allocate single buffers for TX and RX */
		sz = __pktbuf_tx_cfg(&pktbuf[0].tx, drv->pktbuf_addr, mxpktsz);
		drv->pktbuf_addr += sz;
		sz = __pktbuf_rx_cfg(&pktbuf[0].rx, drv->pktbuf_addr, mxpktsz);
		drv->pktbuf_addr += sz;

		__clr_ep_flag(usb, 0, USB_EP_STATUS_OUT);
		__set_ep_rxstat(usb, 0, USB_RX_VALID);

		DCC_LOG1(LOG_TRACE, "[0] epr=0x%04x...", usb->epr[0]);
		return 0;
	}

	__set_ep_addr(usb, ep_id, info->addr & 0x7f);
	__set_ep_rxstat(usb, ep_id, USB_RX_NAK);
	__set_ep_txstat(usb, ep_id, USB_TX_NAK);

	switch (info->attr & 0x03) {
		
#if 0
	case ENDPOINT_TYPE_CONTROL:
		__set_ep_type(usb, ep_id, USB_EP_CONTROL);
		/* allocate single buffers for TX and RX */
		sz = __pktbuf_tx_cfg(&pktbuf[ep_id].tx, drv->pktbuf_addr, mxpktsz);
		drv->pktbuf_addr += sz;
		sz = __pktbuf_rx_cfg(&pktbuf[ep_id].rx, drv->pktbuf_addr, mxpktsz);
		drv->pktbuf_addr += sz;
		DCC_LOG(LOG_INFO, "CONTROL");
		break;
#endif

	case ENDPOINT_TYPE_ISOCHRONOUS:
		DCC_LOG(LOG_INFO, "ISOCHRONOUS");
		break;

	case ENDPOINT_TYPE_BULK:
		__set_ep_type(usb, ep_id, USB_EP_BULK);
		if (info->addr & USB_ENDPOINT_IN) {
#if DOUBLE_BUFFER_ENABLE
			__set_ep_flag(usb, ep_id, USB_EP_DBL_BUF);
			DCC_LOG(LOG_INFO, "BULK IN");
			sz = __pktbuf_tx_cfg(&pktbuf[ep_id].dbtx[0], 
								 drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
			sz = __pktbuf_tx_cfg(&pktbuf[ep_id].dbtx[1], 
								 drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
#else
			sz = __pktbuf_tx_cfg(&pktbuf[ep_id].tx, drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
#endif
			__set_ep_txstat(usb, ep_id, USB_TX_VALID);
		} else {
			__set_ep_flag(usb, ep_id, USB_EP_DBL_BUF);
			DCC_LOG(LOG_INFO, "BULK OUT");
			sz = __pktbuf_rx_cfg(&pktbuf[ep_id].dbrx[0], 
								 drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
			sz = __pktbuf_rx_cfg(&pktbuf[ep_id].dbrx[1], 
								 drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
			__set_ep_rxstat(usb, ep_id, USB_RX_VALID);
		}
		break;

	case ENDPOINT_TYPE_INTERRUPT:
		__set_ep_type(usb, ep_id, USB_EP_INTERRUPT);
		if (info->addr & USB_ENDPOINT_IN) {
			DCC_LOG(LOG_INFO, "INTERRUPT IN");
			sz = __pktbuf_tx_cfg(&pktbuf[ep_id].tx, drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
		} else {
			DCC_LOG(LOG_INFO, "INTERRUPT OUT");
			sz = __pktbuf_rx_cfg(&pktbuf[ep_id].rx, drv->pktbuf_addr, mxpktsz);
			drv->pktbuf_addr += sz;
			__set_ep_rxstat(usb, ep_id, USB_RX_VALID);
		}
		break;
	}

	DCC_LOG1(LOG_INFO, "epr=0x%04x...", usb->epr[ep_id]);

	return ep_id;
}


void stm32f_usb_dev_ep0_out(struct stm32f_usb * usb,
							struct stm32f_usb_ep * ep, 
							struct stm32f_usb_drv * drv)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	int cnt;
	int n;

	if (ep->state == EP_WAIT_STATUS_OUT) {
		ep->state = EP_IDLE;
		DCC_LOG(LOG_INFO, "EP0 OUT [IDLE] >>>>>>>> SETUP END");
		__set_ep_rxstat(usb, 0, USB_RX_VALID);
		return;
	}

	if ((ep->state == EP_IN_DATA) || (ep->state == EP_IN_DATA_LAST)) {
		DCC_LOG(LOG_INFO, "EP0 OUT [STALLED]");
		__ep_stall(usb, 0, ep);
		return;
	}

	//	cnt = MIN(rx->count, max);

	cnt = pktbuf[0].rx.count;
	n = MIN(cnt, ep->xfr_rem);

	__copy_from_pktbuf(ep->xfr_ptr, &pktbuf[0].rx, n);

	ep->xfr_ptr += n;
	ep->xfr_rem -= n;

	if (ep->state == EP_OUT_DATA_LAST) {
		ep->state = EP_WAIT_STATUS_IN;
		DCC_LOG1(LOG_INFO, "EP0 cnt=%d [EP_WAIT_STATUS_IN]", cnt);
		__ep_zlp_send(usb, 0);
		return;
	}

	if (ep->xfr_rem < ep->mxpktsz) {
		/* last transfer */
		ep->state = EP_OUT_DATA_LAST;
		DCC_LOG1(LOG_INFO, "EP0 cnt=%d [OUT_DATA_LAST]", cnt);
	}
	__set_ep_rxstat(usb, 0, USB_RX_VALID);

	DCC_LOG1(LOG_INFO, "EP0 cnt=%d", cnt);
}

static void stm32f_usb_dev_ep0_in(struct stm32f_usb * usb,
								  struct stm32f_usb_ep * ep,
								  struct stm32f_usb_drv * drv)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	void * dummy = NULL;

	DCC_LOG(LOG_MSG, "EP0 IN");

	if (ep->state == EP_WAIT_STATUS_IN) {
		struct usb_request * req = &drv->req;

		if (((req->request << 8) | req->type) == STD_SET_ADDRESS) {
			usb->daddr = req->value | USB_EF;
			DCC_LOG(LOG_INFO, "address set!");
		}
		__set_ep_rxstat(usb, 0, USB_RX_STALL);
		__set_ep_txstat(usb, 0, USB_TX_STALL);
		ep->on_setup(drv->cl, req, dummy);
		ep->state = EP_IDLE;
		DCC_LOG(LOG_INFO, ">>>>>>>> SETUP END");
		return;
	}

