bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
	if (ep->state == EP_IN_DATA_LAST) {
		ep->state = EP_WAIT_STATUS_OUT;
		DCC_LOG(LOG_INFO, "EP0 [WAIT_STATUS_OUT]");
		__set_ep_rxstat(usb, 0, USB_RX_VALID);
		return;
	}

	__ep_pkt_send(usb, 0, ep, &pktbuf[0].tx);

	__set_ep_txstat(usb, 0, USB_TX_VALID);

	if (ep->state == EP_IN_DATA) {
		__set_ep_rxstat(usb, 0, USB_RX_STALL);
	}
}

static void stm32f_usb_dev_ep0_setup(struct stm32f_usb * usb,
									 struct stm32f_usb_ep * ep, 
									 struct stm32f_usb_drv * drv) {
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	struct usb_request * req = &drv->req;
	int cnt;
	int len;

	DCC_LOG(LOG_MSG, "SETUP START <<<<<<<<<<<<<<<");

	cnt = pktbuf[0].rx.count;

#if ENABLE_PEDANTIC_CHECK
	if (cnt != 8) {
		__ep_stall(usb, 0, ep);
		DCC_LOG1(LOG_WARNING, "cnt(%d) != 8 [ERROR]", cnt);
		DCC_LOG1(LOG_MSG, "pktbuf<0x%08x>", pktbuf);
		DCC_XXD(LOG_MSG, "pktbuf", pktbuf, 16);
		return;
	}
#endif

	/* copy data from packet buffer */
	__copy_from_pktbuf(req, &pktbuf[0].rx, cnt);

	DCC_LOG(LOG_MSG, "EP0 [WAIT_STATUS_IN] no data Dev->Host");

	/* No-Data control SETUP transaction */
	if (req->length == 0) {
		__ep_zlp_send(usb, 0);
		DCC_LOG(LOG_MSG, "EP0 [WAIT_STATUS_IN] no data Dev->Host");
		ep->state = EP_WAIT_STATUS_IN;
		return;
	}

	if (req->type & 0x80) {
		/* Control Read SETUP transaction (IN Data Phase) */
		DCC_LOG(LOG_MSG, "EP0 [SETUP] IN Dev->Host");
		ep->xfr_ptr = NULL;
		len = ep->on_setup(drv->cl, req, (void *)&ep->xfr_ptr);
#if ENABLE_PEDANTIC_CHECK
		if (len < 0) {
			__ep_stall(usb, 0, ep);
			DCC_LOG(LOG_MSG, "EP0 [STALLED] len < 0");
			return;
		}
#endif

		ep->xfr_rem = MIN(req->length, len);
		DCC_LOG1(LOG_MSG, "EP0 data lenght = %d", ep->xfr_rem);
		__ep_pkt_send(usb, 0, ep, &pktbuf[0].tx);
		__set_ep_txstat(usb, 0, USB_TX_VALID);
		/* While enabling the last data stage, the opposite direction should
		   be set to NAK, so that, if the host reverses the transfer direction
		   (to perform the status stage) immediately, it is kept waiting for
		   the completion of the control operation. If the control operation
		   completes successfully, the software will change NAK to VALID,
		   otherwise to STALL.
		 */
		if (ep->state == EP_IN_DATA) {
			/* A USB device can determine the number and direction of 
			   data stages by interpreting the data transferred in the 
			   SETUP stage, and is required to STALL the transaction in 
			   the case of errors. To do so, at all data stages before 
			   the last, the unused direction should be set to STALL, so 
			   that, if the host reverses the transfer direction too soon, 
			   it gets a STALL as a status stage.
			 */
			__set_ep_rxstat(usb, 0, USB_RX_STALL);
		}

	} else {
		/* Control Write SETUP transaction (OUT Data Phase) */

		ep->xfr_ptr = ep->xfr_buf;
		ep->xfr_rem = req->length;

		DCC_LOG1(LOG_MSG, "xfr_ptr=0x%08x", ep->xfr_ptr);

		if (ep->xfr_rem > ep->xfr_buf_len) {
			ep->xfr_rem = ep->xfr_buf_len;
			DCC_LOG(LOG_INFO, "transfer to large to fit the buffer!");
		}

		if (ep->xfr_rem < ep->mxpktsz) {
			/* last and only transfer */
			ep->state = EP_OUT_DATA_LAST;
			DCC_LOG(LOG_MSG, "EP0 [OUT_DATA_LAST] OUT Host->Dev!!!!");

		} else {
			ep->state = EP_OUT_DATA;
			DCC_LOG(LOG_MSG, "EP0 [OUT_DATA] OUT Host->Dev!!!!");
		}

		__set_ep_rxstat(usb, 0, USB_RX_VALID);
	}
}

/*
 * Arguments:
 *
 *   drv: pointer to the driver runtime structure.
 *
 *   ep: list of endpoint configuration information. The first item on this list
 *       must be the endpoint 0.
 *
 *  cnt: number of items in the list.
 */

int stm32f_usb_dev_init(struct stm32f_usb_drv * drv, usb_class_t * cl,
						const struct usb_class_events * ev)
{
	struct stm32f_usb * usb = STM32F_USB;
	int i;

#if defined(STM32L4X)
	{
		struct stm32_pwr * pwr = STM32_PWR;

		DCC_LOG1(LOG_MSG, "USB PWR_CR2=0x%08x", &pwr->cr2);
		stm32_clk_enable(STM32_RCC, STM32_CLK_PWR);
		pwr->cr2 |= PWR_USV; 
	}
#endif

	drv->cl = cl;
	drv->ev = ev;

	/* reset packet buffer address pointer */
	drv->pktbuf_addr = PKTBUF_BUF_BASE;

#if (STM32_USB_FS_VBUS_ENABLE)
	/* Pull up connect */
	stm32f_usb_pullup(usb, false);
#endif

	stm32f_usb_power_off(usb);

	udelay(1000);

#if (STM32_USB_FS_IO_INIT)
	/* Initialize IO pins */
	stm32f_usb_io_init();
#endif

	stm32f_usb_power_on(usb);

#if (STM32_USB_FS_VBUS_ENABLE)
	stm32f_usb_pullup(usb, true);
#endif

	for (i = 0;  i < STM32_USB_FS_EP_MAX; ++i) {
		drv->ep[i].state = EP_DISABLED;
	}

	DCC_LOG2(LOG_TRACE, VT_PSH VT_FCY 
			 "ev=0x%08x cl=0x%08x [ATTACHED]" VT_POP, drv->ev, drv->cl);

#if (STM32_USB_FS_IRQ_ENABLE)
	/* enable Cortex interrupts */
#ifdef STM32F_IRQ_USB_LP
	cm3_irq_enable(STM32F_IRQ_USB_LP);
#endif
#ifdef STM32F_IRQ_USB_HP
	cm3_irq_enable(STM32F_IRQ_USB_HP);
#endif
#ifdef STM32_IRQ_USB_FS
	cm3_irq_enable(STM32_IRQ_USB_FS);
#endif
#if (STM32F_IRQ_USB_WKUP) && (STM32_USB_FS_SUSPEND) 
	cm3_irq_enable(STM32F_IRQ_USB_WKUP);
#endif
#endif

#if (STM32_USB_FS_SUSPEND) 
	/* Enable Reset, SOF  and Wakeup interrupts */
	usb->cntr = USB_WKUPM | USB_RESETM;
#else
	/* Enable Reset interrupt */
	usb->cntr = USB_RESETM;
#endif

	return 0;
}

/* Private USB device driver data */
struct stm32f_usb_drv stm32f_usb_drv0;

#ifdef STM32F_IRQ_USB_HP
/* USB high priority ISR */
void stm32f_can1_tx_usb_hp_isr(void)
{
	struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
	struct stm32f_usb_drv * drv = &stm32f_usb_drv0;
	struct stm32f_usb * usb = STM32F_USB;
	struct stm32f_usb_ep * ep;
	uint32_t epr;
	int ep_id;
	uint32_t sr;

	sr = usb->istr;

	ep_id = USB_EP_ID_GET(sr);

	DCC_LOG1(LOG_INFO, "CTR ep_id=%d", ep_id);

	epr = usb->epr[ep_id];
	ep = &drv->ep[ep_id];

	if (epr & USB_CTR_TX) {
		struct stm32f_usb_tx_pktbuf * tx_pktbuf;
#if (ENABLE_IRQ_MASK)
		uint32_t pri;
#endif
		int len;
	
#if (ENABLE_IRQ_MASK)
		pri = cm3_primask_get();
		cm3_primask_set(1);
#endif
		len = ep->xfr_rem;
		(void)len;

		/* IN */
		__clr_ep_flag(usb, ep_id, USB_CTR_TX);

		switch (ep->state) {
		case EP_IDLE:
			DCC_LOG1(LOG_INFO, VT_PSH VT_FGR VT_REV
					 "[%d] IDLE!!!" VT_POP, ep_id);
			break;

