bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
		case EP_IN_DATA_LAST:
#if (ENABLE_DBLBUF_DEBUG)
			DCC_LOG3(LOG_MSG, VT_PSH VT_FGR 
					 "[%d] TX 2 BUF DTOG=%d SW_BUF=%d [EP_IDLE]" 
					 VT_POP, 
					 ep_id, (epr & USB_DTOG_TX) ? 1: 0,
					 (epr & USB_SWBUF_TX) ? 1: 0);
#endif
			ep->state = EP_IDLE;
			/* call class endpoint callback */
			ep->on_in(drv->cl, ep_id);
			break;

		case EP_IN_DATA: 
			/* send the next data chunk */
			if (epr & USB_EP_DBL_BUF) {
//					if (len == 0) {
//						DCC_LOG2(LOG_INFO, VT_PSH VT_FMG 
//								 "[%d] ZLP [EP_IN_DATA_LAST]"
//								 VT_POP, ep_id, len);
//						ep->state = EP_IN_DATA_LAST;
//						__ep_zlp_send(usb, ep_id);
				DCC_LOG4(LOG_MSG, VT_PSH VT_FGR 
						 "[%d] len=%d TX DblBuf DTOG=%d SW_BUF=%d " 
						 VT_POP, ep_id, len,
						 (epr & USB_DTOG_TX) ? 1: 0,
						 (epr & USB_SWBUF_TX) ? 1: 0);
				/* select the descriptor according to the data toggle bit */
				tx_pktbuf = &pktbuf[ep_id].dbtx[(epr & USB_SWBUF_TX) ? 1: 0];
				__ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
				__toggle_ep_flag(usb, ep_id, USB_SWBUF_TX);
			} else {
				DCC_LOG2(LOG_MSG, VT_PSH VT_FGR " len=%d [%d] single" 
						 VT_POP, ep_id, len);
				tx_pktbuf = &pktbuf[ep_id].tx;
				__ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
				__set_ep_txstat(usb, ep_id, USB_TX_VALID);
			}
			break;

		default:
			DCC_LOG1(LOG_INFO, "ep%d: invalid state!!!", ep_id);
			break;

		}
#if (ENABLE_IRQ_MASK)
		cm3_primask_set(pri);
#endif
	}



	if (epr & USB_CTR_RX) {
		struct stm32f_usb_rx_pktbuf * rx_pktbuf;
		int len;

		/* OUT */
		if (epr & USB_EP_DBL_BUF) {
			/* clear interrupt */
			usb->epr[ep_id] = (epr & ~USB_CTR_RX) & USB_EPREG_MASK;
			/* select the descriptor according to the data toggle bit */
			rx_pktbuf = &pktbuf[ep_id].dbrx[(epr >> USB_SWBUF_RX_BIT) & 1];
			len = rx_pktbuf->count;

			if (((epr >> USB_DTOG_RX_BIT) ^
				 (epr >> USB_SWBUF_RX_BIT)) & 1) {
				DCC_LOG4(LOG_MSG, VT_PSH VT_FBL VT_BRI VT_UND
						 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
						 VT_POP, ep_id, 
						 (epr & USB_DTOG_RX) ? 1 : 0, 
						 (epr & USB_SWBUF_RX) ? 1 : 0, rx_pktbuf->count); 
			} 
			if ((len == 0)) {
				DCC_LOG4(LOG_MSG, VT_PSH VT_FYW VT_BRI VT_UND
						 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
						 VT_POP, ep_id, 
						 (epr & USB_DTOG_RX) ? 1 : 0, 
						 (epr & USB_SWBUF_RX) ? 1 : 0, rx_pktbuf->count); 
			} else if (ep->rx_len != ep->rx_pos) {
				DCC_LOG3(LOG_MSG, VT_PSH VT_FRD VT_BRI
						 "[%d] RX len=%d pos=%d !!!" 
						 VT_POP, ep_id, 
						 ep->rx_len,
						 ep->rx_pos);
			} else {
				DCC_LOG3(LOG_MSG, VT_PSH VT_FBL VT_BRI
						 "[%d] RX len=%d pos=%d !!!" 
						 VT_POP, ep_id, 
						 ep->rx_len,
						 ep->rx_pos);
				ep->rx_pktbuf = rx_pktbuf;
				ep->rx_len = len;
				ep->rx_pos = 0;
			}
				/* call class endpoint callback */
			ep->on_out(drv->cl, ep_id, len);
		} else {
			/* single buffer */
			__clr_ep_flag(usb, ep_id, USB_CTR_RX);
			rx_pktbuf = &pktbuf[ep_id].rx;
			len = rx_pktbuf->count;
			ep->rx_pktbuf = rx_pktbuf;
			ep->rx_len = len;
			ep->rx_pos = 0;
			/* call class endpoint callback */
			ep->on_out(drv->cl, ep_id, len);
		}
	}



#ifdef DEBUG
	if (sr & USB_ESOF) {
		DCC_LOG(LOG_INFO, "USB_ESOF");
		usb->istr = ~USB_ESOF;
	}

	if (sr & USB_ERR) {
		DCC_LOG(LOG_INFO, "USB_ERR");
		usb->istr = ~USB_ERR;
	}

	if (sr & USB_PMAOVR) {
		DCC_LOG(LOG_INFO, "USB_PMAOVR");
		usb->istr = ~USB_PMAOVR;
	}
#endif
}
#endif

#ifdef STM32_IRQ_USB_FS
/* Single interrupt handler */
void stm32_usb_fs_isr(void)
#endif

#ifdef STM32F_IRQ_USB_LP
/* USB low priority ISR */
void stm32f_can1_rx0_usb_lp_isr(void)
#endif
{
	struct stm32f_usb_drv * drv = &stm32f_usb_drv0;
	struct stm32f_usb * usb = STM32F_USB;
	uint32_t sr = usb->istr;

	if (sr & USB_CTR) {
		struct stm32f_usb_pktbuf * pktbuf = STM32F_USB_PKTBUF;
		struct stm32f_usb_ep * ep;
		uint32_t epr;
		int ep_id;

		/*
		 * The CTR_RX event is serviced by first
		 determining the transaction type (SETUP bit in the USB_EPnR 
		 register); the application software must clear the interrupt 
		 flag bit and get the number of received bytes reading the 
		 COUNTn_RX location inside the buffer description table entry 
		 related to the endpoint being processed. After the received 
		 data is processed, the application software should set the 
		 STAT_RX bits to ‘11 (Valid) in the USB_EPnR, enabling further 
		 transactions. While the STAT_RX bits are equal to ‘10 (NAK), 
		 any OUT request addressed to that endpoint is NAKed, indicating 
		 a flow control condition: the USB host will retry the 
		 transaction until it succeeds. It is mandatory to execute the 
		 sequence of operations in the above mentioned order to avoid 
		 losing the notification of a second OUT transaction addressed 
		 to the same endpoint following immediately the one which 
		 triggered the CTR interrupt.
		 */

		/* clear interrupt */
		usb->istr = sr & ~USB_CTR;

		ep_id = USB_EP_ID_GET(sr);

		DCC_LOG1(LOG_JABBER, "CTR ep_id=%d", ep_id);

		epr = usb->epr[ep_id];
		ep = &drv->ep[ep_id];

		if (ep_id == 0) {
			/* Service control point */
			__set_ep_rxstat(usb, ep_id, USB_RX_NAK);
			__set_ep_txstat(usb, ep_id, USB_TX_NAK);

			if (((sr & USB_DIR) == 0) || (epr & USB_CTR_TX)) {
				/* DIR = 0 -> IN */
				__clr_ep_flag(usb, 0, USB_CTR_TX);
				stm32f_usb_dev_ep0_in(usb, ep, drv);
			} else {
				/* DIR = 1 -> OUT/SETUP */
				__clr_ep_flag(usb, 0, USB_CTR_RX);
				if (epr & USB_SETUP) {
					/* SETUP */
					stm32f_usb_dev_ep0_setup(usb, ep, drv);
				} else {
					/* OUT */
					stm32f_usb_dev_ep0_out(usb, ep, drv);
				}
			}
			return;
		}

		 (void)pktbuf;
#ifdef STM32_IRQ_USB_FS
		if (epr & USB_CTR_TX) {
			struct stm32f_usb_tx_pktbuf * tx_pktbuf;
#if (ENABLE_IRQ_MASK)
			uint32_t pri;
#endif
			int len;
		
#if (ENABLE_IRQ_MASK)
			pri = cm3_primask_get();
			cm3_primask_set(1);
#endif
			len = ep->xfr_rem;
			(void)len;

			/* IN */
			__clr_ep_flag(usb, ep_id, USB_CTR_TX);

			switch (ep->state) {
			case EP_IDLE:
				DCC_LOG1(LOG_INFO, VT_PSH VT_FGR VT_REV
						 "[%d] IDLE!!!" VT_POP, ep_id);
				break;

