bobmittmann/thinkos/arch/stm32/libstm32f/usb_fs/stm32f-usb_fs_dev.c
			case EP_IN_DATA_LAST:
#if (ENABLE_DBLBUF_DEBUG)
				DCC_LOG3(LOG_MSG, VT_PSH VT_FGR 
						 "[%d] TX 2 BUF DTOG=%d SW_BUF=%d [EP_IDLE]" 
						 VT_POP, 
						 ep_id, (epr & USB_DTOG_TX) ? 1: 0,
						 (epr & USB_SWBUF_TX) ? 1: 0);
#endif
				ep->state = EP_IDLE;
				/* call class endpoint callback */
				ep->on_in(drv->cl, ep_id);
				break;

			case EP_IN_DATA: 
				/* send the next data chunk */
				if (epr & USB_EP_DBL_BUF) {
					DCC_LOG4(LOG_MSG, VT_PSH VT_FGR 
							 "[%d] len=%d TX DblBuf DTOG=%d SW_BUF=%d " 
							 VT_POP, ep_id, len,
							 (epr & USB_DTOG_TX) ? 1: 0,
							 (epr & USB_SWBUF_TX) ? 1: 0);
					/* select the descriptor according to the data toggle bit */
					tx_pktbuf = &pktbuf[ep_id].dbtx[(epr & USB_SWBUF_TX) ? 1: 0];
					__ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
					__toggle_ep_flag(usb, ep_id, USB_SWBUF_TX);
				} else {
					DCC_LOG2(LOG_MSG, VT_PSH VT_FGR " len=%d [%d] single" 
							 VT_POP, ep_id, len);
					tx_pktbuf = &pktbuf[ep_id].tx;
					__ep_pkt_send(usb, ep_id, ep, tx_pktbuf);
					__set_ep_txstat(usb, ep_id, USB_TX_VALID);
				}
				break;

			default:
				DCC_LOG1(LOG_INFO, "ep%d: invalid state!!!", ep_id);
				break;

			}
#if (ENABLE_IRQ_MASK)
			cm3_primask_set(pri);
#endif
			return;
		}

		if (epr & USB_CTR_RX) {
			struct stm32f_usb_rx_pktbuf * rx_pktbuf;
			int len;

			/* OUT */
			if (epr & USB_EP_DBL_BUF) {
				/* clear interrupt */
				usb->epr[ep_id] = (epr & ~USB_CTR_RX) & USB_EPREG_MASK;
				/* select the descriptor according to the data toggle bit */
				rx_pktbuf = &pktbuf[ep_id].dbrx[(epr >> USB_SWBUF_RX_BIT) & 1];
				len = rx_pktbuf->count;

				if (((epr >> USB_DTOG_RX_BIT) ^
					 (epr >> USB_SWBUF_RX_BIT)) & 1) {
					DCC_LOG4(LOG_MSG, VT_PSH VT_FBL VT_BRI VT_UND
							 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
							 VT_POP, ep_id, 
							 (epr & USB_DTOG_RX) ? 1 : 0, 
							 (epr & USB_SWBUF_RX) ? 1 : 0, rx_pktbuf->count); 
				} 
				if ((len == 0)) {
					DCC_LOG4(LOG_MSG, VT_PSH VT_FYW VT_BRI VT_UND
							 "[%d] RX DblBuf DOTG=%d SW_BUF=%d cnt=%d" 
							 VT_POP, ep_id, 
							 (epr & USB_DTOG_RX) ? 1 : 0, 
							 (epr & USB_SWBUF_RX) ? 1 : 0, rx_pktbuf->count); 
				} else if (ep->rx_len != ep->rx_pos) {
					DCC_LOG3(LOG_MSG, VT_PSH VT_FRD VT_BRI
							 "[%d] RX len=%d pos=%d !!!" 
							 VT_POP, ep_id, 
							 ep->rx_len,
							 ep->rx_pos);
				} else {
					DCC_LOG3(LOG_MSG, VT_PSH VT_FBL VT_BRI
							 "[%d] RX len=%d pos=%d !!!" 
							 VT_POP, ep_id, 
							 ep->rx_len,
							 ep->rx_pos);
					ep->rx_pktbuf = rx_pktbuf;
					ep->rx_len = len;
					ep->rx_pos = 0;
				}
					/* call class endpoint callback */
				ep->on_out(drv->cl, ep_id, len);
			} else {
				/* single buffer */
				__clr_ep_flag(usb, ep_id, USB_CTR_RX);
				rx_pktbuf = &pktbuf[ep_id].rx;
				len = rx_pktbuf->count;
				ep->rx_pktbuf = rx_pktbuf;
				ep->rx_len = len;
				ep->rx_pos = 0;
				/* call class endpoint callback */
				ep->on_out(drv->cl, ep_id, len);
			}
		}
#endif /* STM32_IRQ_USB_FS */
		return;	
	}

#if (STM32_USB_FS_SUSPEND) 
	if (sr & USB_SUSP) {
		/* clear interrupts */
		usb->istr = ~USB_SUSP;
		DCC_LOG(LOG_INFO, "SUSP");
		stm32f_usb_dev_suspend(drv);
	}

	if (sr & USB_WKUP) {
		usb->istr = ~USB_WKUP;
		DCC_LOG(LOG_INFO, "WKUP");
		stm32f_usb_dev_wakeup(drv);
	}
#endif

	if (sr & USB_RESET) {
		usb->istr = ~USB_RESET;
		DCC_LOG(LOG_MSG, VT_PSH VT_FYW VT_REV VT_BRI
				" RESET " VT_POP);
		stm32f_usb_dev_reset(drv);
	}

#ifdef DEBUG
	if (sr & USB_ERR) {
		usb->istr = ~USB_ERR;
		DCC_LOG(LOG_WARNING, VT_PSH VT_FRD VT_REV
				" ERR " VT_POP);
		/* The USB software can usually ignore errors, since the 
		   USB peripheral and the PC host manage retransmission in case 
		   of errors in a fully transparent way. */
		drv->ev->on_error(drv->cl, 1);
	}

	if (sr & USB_PMAOVR) {
		usb->istr = ~USB_PMAOVR;
		DCC_LOG(LOG_WARNING,  VT_PSH VT_FRD VT_REV
				" PMAOVR " VT_POP);
	}
#endif

#if 0
	if (sr & USB_SOF) {
		usb->istr = ~USB_SOF;
		DCC_LOG(LOG_INFO, "USB_SOF");
		/* mask interrupt */
		usb->cntr &= ~USB_SOFM;
		drv->ev->on_sof(drv->cl);
	}
#endif
}

#if (STM32_USB_FS_SUSPEND) 
void stm32f_usb_wkup_isr(void) 
{
	struct stm32f_usb_drv * drv = &stm32f_usb_drv0;
	struct stm32f_usb * usb = STM32F_USB;
	uint32_t sr = usb->istr;

	if (sr & USB_CTR) {
		usb->istr = ~USB_WKUP;
		DCC_LOG(LOG_INFO, "WKUP");
		stm32f_usb_dev_wakeup(drv);
	}
}
#endif

/* USB device operations */
const struct usb_dev_ops stm32f_usb_ops = {
	.dev_init = (usb_dev_init_t)stm32f_usb_dev_init,
	.ep_init = (usb_dev_ep_init_t)stm32f_usb_dev_ep_init,
	.ep_ctl = (usb_dev_ep_ctl_t)stm32f_usb_dev_ep_ctl,
	.ep_pkt_xmit = (usb_dev_ep_pkt_xmit_t)stm32f_usb_ep_pkt_xmit,
	.ep_pkt_recv = (usb_dev_ep_pkt_recv_t)stm32f_usb_dev_ep_pkt_recv
};

/* USB device driver */
const struct usb_dev stm32f_usb_fs_dev = {
	.priv = (void *)&stm32f_usb_drv0,
	.op = &stm32f_usb_ops
};

#endif /* STM32_ENABLE_USB_FS && STM32F_USB */


